---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.GetHtmlDescription
source: html/053eb5d2-d970-e3ca-ecd6-fe9fccdd605d.htm
---
# Autodesk.Revit.DB.Plumbing.IPipePlumbingFixtureFlowServer.GetHtmlDescription Method

The method that Revit will invoke to get an HTML formatted description of the server.

## Syntax (C#)
```csharp
string GetHtmlDescription()
```

## Returns
The HTML format description of the server.

## Remarks
The HTML description is used by Revit unless it is empty or the server is not available, in which case, Revit will use the plain text description from IExternalServer.GetDescription().